Show / Hide Table of Contents
Class CoordSystemByVector
Coordinate system defined by vectors
Inheritance
System.Object
OpenObject
CoordSystem
CoordSystemByVector
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry3D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry3D.CoordSystemByVector,CI.Geometry3D")]
public class CoordSystemByVector : CoordSystem
Properties
Improve this Doc   View Source
VecX
Axis X unit vector
Declaration
public Vector3D VecX { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
VecY
Axis Y unit vector
Declaration
public Vector3D VecY { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
VecZ
Axis Z unit vector
Declaration
public Vector3D VecZ { get; set; }
Property Value
 Type |  Description
 Vector3D
 Improve this Doc
 View Source